; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 780229 2 2 4 8 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph3 - mode
	infrared2 - mode
	spectrograph1 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star7 - direction
	Star2 - direction
	Star6 - direction
	GroundStation5 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph3)
	(supports instrument3 infrared2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Planet10)
	(have_image Planet8 spectrograph1)
	(have_image Phenomenon9 infrared2)
	(have_image Planet10 spectrograph1)
	(have_image Phenomenon11 infrared0)
	(have_image Star12 spectrograph3)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (turn_to satellite0 groundstation0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 7
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 7
4. (turn_to satellite1 groundstation5 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation5)
   goals met: 1 of 7
5. (calibrate satellite1 instrument3 groundstation5)
   added: (calibrated instrument3)
   goals met: 1 of 7
6. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 7
8. (turn_to satellite1 star12 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star12)
   goals met: 0 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
10. (take_image satellite1 star12 instrument3 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 1 of 7
11. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 1 of 7
12. (turn_to satellite1 phenomenon9 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 7
13. (turn_to satellite0 phenomenon11 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 7
14. (take_image satellite1 phenomenon9 instrument3 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 2 of 7
15. (take_image satellite0 phenomenon11 instrument0 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 3 of 7
16. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 3 of 7
17. (turn_to satellite1 planet8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet8)
   goals met: 3 of 7
18. (turn_to satellite0 groundstation0 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 7
19. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 7
20. (turn_to satellite1 star2 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star2)
   goals met: 4 of 7
21. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 4 of 7
22. (turn_to satellite1 planet8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet8)
   goals met: 4 of 7
23. (take_image satellite1 planet8 instrument2 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 5 of 7
24. (turn_to satellite1 planet10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet10)
   goals met: 6 of 7
25. (take_image satellite1 planet10 instrument2 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 7 of 7
